# GetMaterialIds Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyAnalysisConstruction..::..GetMaterialIds Method
EnergyAnalysisConstruction Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetMaterialIds()()()() | Returns a list of ids of the associated materials to analytical construction. |
| GetMaterialIds(Boolean) | Gets the element ids of all materials present in the element.  (Inherited from Element.) |

# See Also
EnergyAnalysisConstruction Class
EnergyAnalysisConstruction Members
Autodesk.Revit.DB.Analysis Namespace